### Warm-up Exercises:

For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

#### - Has the network latency gone up since we switched internet service providers?

- H(null) hypothesis: There's no difference or latency decreased in network speed since switching one company to the next.
    
- H(a) hypothesis: There is an increase in latency since switching from one company to the next.

- True Negative Type 1 Error example: We reject the H(null) that there is no difference of latency, when there really is.

- False Negative Type 2 Error example: We fail to reject the H(null), by saying that there is a speed difference but the reality is that we also had added 1,000 more computers to the network too and THAT was why the speed decreased...not the network. 

- True Positive: I determined that the network latency has increased and it has.

- True Negative: I determined that the network latency has decreased or is no different, and it is true.

 { This example would be determined by a <b> Paired t-test</b>.  Where we look at our data under the previous condition and then look at the sample data under the current condition }

#### - Is the website redesign any good?

- <i>Rephrasing: What webpages are most customers engaged on and on avg, how long are they on our website?</i>

- H(null)hypothesis: There are no customers coming to the website and engaging.
    
- H(a)hypothesis: There are x amount of customers that are on our webpages an average x amount of time AND navigating throughout pages.
    
- Type 1 error example: We say "Yes, we have x amount of customers visitng for x amount of time", but find that the IP addresses vists are bots.
    
- Type 2 error example: We say "No-one is coming to our site, or the wanted engagement isn't being met" and do not take into account that we are only testing on weekend days.

- True Positive: I determined that there was an increase of number of daily visits and it has.

- True Negative: I determined that there was no change (or a decrease) in the number of daily visits and it has

{Think about the number of confounding factors that might drive changes to a websites activity beyond a simple redesign. (like when, why, how of changing a website)

Sometimes perfect comparisons are not achievable in the rapidly changing business world.

We need to understand that as data scientists, we need to NOT claim "this has increased due to ___", but rather saying "the data shows that there is a relationship that shows an increase after the website redesign"...because we really don't know the causality until further experiments.}

#### - Is our television ad driving more sales?

- <i> Rephrasing: Have we since seen an increase of sales since our tv ad has aired? How can we determine where our customers are coming from?
    
- H(null)hypothesis: There is no increase in sales since our ad aired.
    
-H(a)hypothesis: We have made x amount of sales since our ad aired date, AND we can track that the sales are directly related to the tv ad.
    
- True Negative example: I determine sales volume has stayed the same or decreased and it has.
    
- True Positive: I determine sales volume has increased and it did.
    
- Type 1 Error: I determine sales volume has increased when it actually decreased.
    
- Type 2 Error: I determine sales volume has decreased when it has actualy increased.

 ____________________________________________________

## Exercises : T-test

### Exercise One:

Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. 

A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. 
A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. 
Use a .05 level of significance.

In [1]:
import numpy as np
import seaborn as sns
import scipy.stats as stats
import pandas as pd
import matplotlib.pyplot as plt
import env

ùõº  = 0.05

#office1
mean1 = 90
sdev1 = 15
ssize1 = 40

#office2
mean2 = 100
sdev2 = 20
ssize2 = 50

### What are we comparing?

- average time (numberic continuous values)for two different groups(categories)
- One sample or two?
- One tailed or two tailed?

In [ ]:
# H_0: Average time to sell at office 1 == average time to sell at office 2
#H_a: Average time to sell at office 1 != average time to sell at office 2
t,p=stats.stats.ttest_ind_from_stats(mean1, sdev1, ssize1, mean2, sdev2, ssize2, equal_var=True)

In [ ]:
alpha = 0.05

In [ ]:
# visualize distributions

x = np.arange(50,150)

y1 = stats.norm(90, 15).pdf(x)
y1 = stats.norm(100, 20).pdf(x)

In [ ]:
t, p = stats.ttest_ind_from_stats(90,15,40,100,20,50, equal_var=False)
t,p

In [ ]:
if (p < alpha ):
    print ("We reject the null hypothesis!")
else:
    print("We accept the null hypothesis!")

### Exercise Two:
Load the mpg dataset and use it to answer the following questions:

Is there a difference in fuel-efficiency in cars from 2008 vs 1999?
Are compact cars more fuel-efficient than the average car?
Do manual cars get better gas mileage than automatic cars?

In [ ]:
from pydataset import data
mpg = data('mpg')

In [ ]:
mpg

In [ ]:
#H_0: There is no difference in fuel efficiency in cars from 2008 and 1999
#H-a: There is a difference in fuel efficiency in cars from 2008 and 1999

In [ ]:
How should we measure "fuel-efficiency"?
Two approaches:
    - Run two ttests: one for highway and one for city
    -

In [ ]:
mpg

In [ ]:
#getting two ojects based on year
cars_2008 = mpg[mpg.year == 2008]
cars_1999 = mpg[mpg.year == 1999]

In [ ]:
cars_1999.hist()

In [ ]:
#finding the average number of hwy & cty combined

avg_hwy= mpg.hwy.mean()

avg_cty = mpg.cty.mean()

avg_mpg = avg_hwy + avg_cty

avg_mpg

In [ ]:
combined_mpg= mpg.hwy + mpg.cty

In [ ]:
#new column for combined mpg
mpg['Combined MPG'] = mpg.hwy + mpg.cty
mpg

In [ ]:
#find 2008 fuel efficient cars (above the avg mpg)
cars_2008 = mpg[(mpg.year == 2008) & (mpg['Combined MPG'] >= 40)]
cars_2008['Combined MPG'].value_counts()

In [ ]:
cars_1999 = mpg[(mpg.year == 1999) & (mpg['Combined MPG'] >= 40)]

In [ ]:
cars_1999.var(), cars_2008.var()

In [ ]:
t, p = stats.ttest_ind(cars_1999, cars_2008, equal_var= True)

## Correlation Exercises:

### Exercise 1)
Use the telco_churn data. Does tenure correlate with monthly charges? Total charges? What happens if you control for phone and internet service?

In [ ]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib as plt
import scipy.stats as stats
df = pd.read_csv("Copy of Jennifer Eyring - jemison_spreadsheet_exercises - Table1_Copy.csv")

In [ ]:
df.head()

In [ ]:
#renamed to call on later
df=df.rename(columns={"Service Type": "service_type"})
df

### Does Tenure relate to Monthly Charges?

H0: There is no relation to Monthly charges and tenure
Ha: There is a relation to Monthly charges and tenure

In [ ]:
df.plot.scatter(y='monthly_charges', x='tenure')

In [ ]:
alpha = 0.05

In [ ]:
x = df.tenure
y = df.monthly_charges

In [ ]:
r, p = stats.pearsonr(x,y)
r,p

<b> Conclusion: There is a weak relationship between monthly charges and tenure but it is there.
- Reject the null hypothesis</b>

In [ ]:
if p < alpha:
    print('Reject the null hypothesis')
else:
    print('Fail to rejcet the null hypothesis')

### Does Tenure relate to Total Charges?

In [ ]:
df.plot.scatter(y='total_charges', x='tenure')
#visually, yes it looks like there might be a relationship between total and tenure

In [ ]:
x = df.tenure
y = df.total_charges
#to drop nulls, look at spaces needing to be replaced,drop na mehtod (subset dataframe for two variables)

In [ ]:
##cleaning data for any spaces...
df['tenure']= df.tenure.replace(' ',np.nan)
df['total_charges']= df.total_charges.replace(" ",np.nan)

In [ ]:
df_xy=df[['tenure','total_charges','service_type']].dropna()
df_xy

In [ ]:
x=df_xy.tenure
y=df_xy.total_charges

In [ ]:
r, p = stats.pearsonr(x,y)
r,p

#### Conclusion: There is a strong positive correlation between tenure and total_charges

In [ ]:
if p < alpha:
    print('Reject the null hypothesis')
else:
    print('Fail to rejcet the null hypothesis')

### What happens if I control for phone and internet service?

In [ ]:
sns.relplot(data=df_xy, y='total_charges', x='tenure', col='service_type',height=8.27, aspect=11.7/8.27)

In [ ]:
df_xy.value_counts('service_type')

In [ ]:
phone=df_xy[df_xy.service_type == 'Phone']
Internet=df_xy[df_xy.service_type == 'Internet']

In [ ]:
r, p = stats.pearsonr(phone.tenure, phone.total_charges)
print('Phone Customers')
print('  r =', r)
print('  p =', p)

In [ ]:
r, p = stats.pearsonr(Internet.tenure, Internet.total_charges)
print('Internet Customers')
print('  r =', r)
print('  p =', p)

### Exercise 2)

In [ ]:
import pandas as pd
import env
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

salaries = pd.read_sql('SELECT * FROM salaries', url)
titles = pd.read_sql('SELECT * FROM titles', url)
employees = pd.read_sql('SELECT * FROM employees', url)

Use the employees database.
- Is there a relationship between how long an employee has been with the company and their salary?

In [ ]:
salaries.head()

In [ ]:
df_salary = pd.concat([salaries, employees])
df_salary

In [ ]:
df_salary = df_salary['hire_date']= df_salary.hire_date.replace('NaN',0)
df_salary=df_salary[['hire_date']].dropna()

In [ ]:
df_salary.head()

- Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [ ]:
#Combining tables into one dataframe
df_jobs = pd.concat([salaries, titles])
df_jobs

In [ ]:
df_jobs['tenure']= df.tenure.replace(' ',np.nan)

In [ ]:
#adding a new column for titles
df_jobs["title_count"] = df_jobs["title"]
df_jobs.head()

In [ ]:
#realized I need to clean up the NaNs:
df_jobs['title']= df_jobs.title.replace('NaN',np.nan)
df_jobs=df_jobs[['title']].dropna()
df_jobs

In [ ]:
#title_salary = pd.concat[salaries,titles]

#salaries['salary_count']= titles['title'].nunique(axis=1)

#title_salary

### Chi Square Exercises

### Exercise One:
Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

In [155]:
alpha = .05
index = ['Uses a Mac Book', 'Does not Own a Mac Book']
columns = ['Codeup_Student', 'Not_Codeup_Student']

observed = pd.DataFrame([[49, 20], [1, 30]], index=index, columns=columns)
observed

                         Codeup_Student  Not_Codeup_Student
Uses a Mac Book                      49                  20
Does not Own a Mac Book               1                  30

In [156]:
chi2, p, defg, expected = stats.chi2_contingency(observed)
p

1.4116760526193828e-09

#### Answer: We don't have enough evidence to reject the null hypothesis

________________________________________________________________________________

### Exercise Two:

Choose another 2 categorical variables from the mpg dataset and perform a 
c
h
i
2
 contingency table test with them. Be sure to state your null and alternative hypotheses.

In [15]:
from pydataset import data
mpg = data('mpg')

In [22]:
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

Let's use model & transmission to look at relationships.

H0: Model and Transmission of a vehicle are Independant variables from one another.

In [23]:
observed = pd.crosstab(mpg.model, mpg.trans)
chi2, p, defg, expected = stats.chi2_contingency(observed)
p

9.686724361961055e-09

In [ ]:
# There is definitely a relationship here

#### Answer: We Reject the Null Hypothesis

___________________________________________________________________________

### Exercise Three:

Use the data from the employees database to answer these questions:

- Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)
- Is an employee's gender independent of whether or not they are or have been a manager?

In [148]:
import pandas as pd
import env
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

salaries = pd.read_sql('SELECT * FROM salaries', url)
titles = pd.read_sql('SELECT * FROM titles', url)
employees = pd.read_sql('SELECT * FROM employees', url)

In [112]:
departments = pd.read_sql('SELECT * FROM departments', url)
dep_emp = pd.read_sql('SELECT * FROM dept_emp', url)

In [113]:
e = employees
d = departments
de = dep_emp

In [114]:
dep_emp

        emp_no dept_no   from_date     to_date
0        10001    d005  1986-06-26  9999-01-01
1        10002    d007  1996-08-03  9999-01-01
2        10003    d004  1995-12-03  9999-01-01
3        10004    d004  1986-12-01  9999-01-01
4        10005    d003  1989-09-12  9999-01-01
...        ...     ...         ...         ...
331598  499995    d004  1997-06-02  9999-01-01
331599  499996    d004  1996-05-13  9999-01-01
331600  499997    d005  1987-08-30  9999-01-01
331601  499998    d002  1993-12-27  9999-01-01
331602  499999    d004  1997-11-30  9999-01-01

[331603 rows x 4 columns]

In [115]:
d.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [143]:
sql_query = '''
SELECT 
employees.gender,
departments.dept_name
FROM employees
JOIN 
dept_emp ON employees.emp_no = dept_emp.emp_no
JOIN 
departments ON dept_emp.dept_no = departments.dept_no
WHERE departments.dept_name IN ('Sales','Marketing')
AND dept_emp.to_date > NOW();
'''

In [144]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

In [146]:
df = pd.read_sql(sql_query, url)
df.head()

  gender  dept_name
0      F  Marketing
1      M  Marketing
2      F  Marketing
3      F  Marketing
4      F  Marketing

In [147]:
observed = pd.crosstab(df.gender, df.dept_name)
chi2, p, defg, expected = stats.chi2_contingency(observed)
p

0.5691938610810126

#### Answer: We Do NOT reject the Null Hypothesis

### Is an employee's gender independent of whether or not they are or have been a manager?

In [150]:
query = '''
SELECT 
employees.gender,
titles.title
FROM employees
JOIN 
titles ON employees.emp_no = titles.emp_no
WHERE titles.title = 'Manager';
'''

In [151]:
df = pd.read_sql(query, url)
df.head()

  gender    title
0      M  Manager
1      M  Manager
2      M  Manager
3      F  Manager
4      F  Manager

In [152]:
observed = pd.crosstab(df.gender, df.title)
chi2, p, defg, expected = stats.chi2_contingency(observed)
p

1.0

#### Answer: We Do NOT reject the Null Hypothesis